Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/2.4.121/Atmel.SAMV70_DFP.pdsc
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="2.4.0" condition="ATSAMV70J19">
         <description>Headers and startup code for Atmel ATSAMV70J19</description>
         <files>
            <file condition="C" category="include" name="samv70/include"/>
            <file condition="C" category="header" name="samv70/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv70/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv70/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv70/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv70/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv70/gcc/gcc/startup_samv70j19.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv70/gcc/system_samv70j19.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv70/gcc/gcc/samv70j19_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv70/gcc/gcc/samv70j19_sram.ld" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv70/iar/iar/startup_samv70j19.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv70/iar/system_samv70j19.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv70/iar/config/linker/Microchip/atsamv70j19/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv70/iar/config/linker/Microchip/atsamv70j19/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="2.4.0" condition="ATSAMV70N19">
         <description>Headers and startup code for Atmel ATSAMV70N19</description>
         <files>
            <file condition="C" category="include" name="samv70/include"/>
            <file condition="C" category="header" name="samv70/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv70/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv70/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv70/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv70/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv70/gcc/gcc/startup_samv70n19.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv70/gcc/system_samv70n19.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv70/gcc/gcc/samv70n19_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv70/gcc/gcc/samv70n19_sram.ld" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv70/iar/iar/startup_samv70n19.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv70/iar/system_samv70n19.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv70/iar/config/linker/Microchip/atsamv70n19/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv70/iar/config/linker/Microchip/atsamv70n19/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="2.4.0" condition="ATSAMV70N20B">
         <description>Headers and startup code for Atmel ATSAMV70N20B</description>
         <files>
            <file condition="C" category="include" name="samv70b/include"/>
            <file condition="C" category="header" name="samv70b/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv70b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv70b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv70b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv70b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv70b/gcc/gcc/startup_samv70n20b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv70b/gcc/system_samv70n20b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv70b/gcc/gcc/samv70n20b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv70b/gcc/gcc/samv70n20b_sram.ld" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv70b/iar/iar/startup_samv70n20b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv70b/iar/system_samv70n20b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv70b/iar/config/linker/Microchip/atsamv70n20b/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv70b/iar/config/linker/Microchip/atsamv70n20b/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="2.4.0" condition="ATSAMV70N19B">
         <description>Headers and startup code for Atmel ATSAMV70N19B</description>
         <files>
            <file condition="C" category="include" name="samv70b/include"/>
            <file condition="C" category="header" name="samv70b/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv70b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv70b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv70b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv70b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv70b/gcc/gcc/startup_samv70n19b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv70b/gcc/system_samv70n19b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv70b/gcc/gcc/samv70n19b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv70b/gcc/gcc/samv70n19b_sram.ld" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv70b/iar/iar/startup_samv70n19b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv70b/iar/system_samv70n19b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv70b/iar/config/linker/Microchip/atsamv70n19b/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv70b/iar/config/linker/Microchip/atsamv70n19b/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="2.4.0" condition="ATSAMV70Q20B">
         <description>Headers and startup code for Atmel ATSAMV70Q20B</description>
         <files>
            <file condition="C" category="include" name="samv70b/include"/>
            <file condition="C" category="header" name="samv70b/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv70b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv70b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv70b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv70b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv70b/gcc/gcc/startup_samv70q20b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv70b/gcc/system_samv70q20b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv70b/gcc/gcc/samv70q20b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv70b/gcc/gcc/samv70q20b_sram.ld" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv70b/iar/iar/startup_samv70q20b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv70b/iar/system_samv70q20b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv70b/iar/config/linker/Microchip/atsamv70q20b/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv70b/iar/config/linker/Microchip/atsamv70q20b/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="2.4.0" condition="ATSAMV70J20B">
         <description>Headers and startup code for Atmel ATSAMV70J20B</description>
         <files>
            <file condition="C" category="include" name="samv70b/include"/>
            <file condition="C" category="header" name="samv70b/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv70b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv70b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv70b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv70b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv70b/gcc/gcc/startup_samv70j20b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv70b/gcc/system_samv70j20b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv70b/gcc/gcc/samv70j20b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv70b/gcc/gcc/samv70j20b_sram.ld" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv70b/iar/iar/startup_samv70j20b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv70b/iar/system_samv70j20b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv70b/iar/config/linker/Microchip/atsamv70j20b/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv70b/iar/config/linker/Microchip/atsamv70j20b/flash.icf" attr="config"/>
         </files>
      </component>
   </components>
</package>
